In [ ]:
 pip install mysql-connector-python --q

In [1]:
import pandas as pd
import mysql.connector

In [2]:
# Connect to MySQL
conn = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="Mydatabase1234"
)

In [3]:
# Create a cursor
cursor = conn.cursor()

In [4]:
# Create logistic database
cursor.execute("CREATE DATABASE IF NOT EXISTS logistic")
print("Database created successfully")

Database created successfully

In [5]:
# Connect to logistic database
conn = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="Mydatabase1234",
    database="logistic"
)
cursor = conn.cursor()

In [6]:
from sqlalchemy import create_engine

# connection string
connection_string = 'mysql+pymysql://root:Mydatabase1234@127.0.0.1:3306/logistic'

In [7]:
# Create SQLAlchemy engine
engine = create_engine(connection_string)

In [8]:
drivers = pd.read_csv('drivers.csv')
drivers

    driver_id        name license_number availability
0          D1    Driver_1        LIC8287  Unavailable
1          D2    Driver_2        LIC9354    Available
2          D3    Driver_3        LIC3069    Available
3          D4    Driver_4        LIC4692    Available
4          D5    Driver_5        LIC7922  Unavailable
..        ...         ...            ...          ...
195      D196  Driver_196        LIC6789  Unavailable
196      D197  Driver_197        LIC9132  Unavailable
197      D198  Driver_198        LIC3817  Unavailable
198      D199  Driver_199        LIC2692    Available
199      D200  Driver_200        LIC4612  Unavailable

[200 rows x 4 columns]

In [13]:
# Create player table
cursor.execute("""
CREATE TABLE IF NOT EXISTS drivers (
    driver_id VARCHAR(50),
    Name VARCHAR(100),
    license_number VARCHAR(100),
    availability VARCHAR(100)
    
)
""")
print("drivers table created successfully")

drivers table created successfully

In [14]:
drivers.to_sql('drivers', con=engine, if_exists='append', index=False)

# Close the database connection
#engine.dispose()

200

In [15]:
delivery_times = pd.read_csv('delivery_times.csv')
delivery_times

    shipment_id  delivery_time_days delivery_date
0            S1                   8    2023-01-09
1            S2                  10    2023-01-07
2            S3                   5    2023-01-13
3            S4                   7    2023-01-14
4            S5                  10    2023-01-06
..          ...                 ...           ...
995        S996                   5    2025-09-28
996        S997                   1    2025-10-01
997        S998                   6    2025-10-02
998        S999                   2    2025-10-05
999       S1000                   8    2025-09-27

[1000 rows x 3 columns]

In [16]:
# Create player table
cursor.execute("""
CREATE TABLE IF NOT EXISTS delivery_times (
    shipment_id VARCHAR(50),
    delivery_time_days INT,
    delivery_date DATE
    
)
""")
print("delivery_times table created successfully")

delivery_times table created successfully

In [18]:
delivery_times.to_sql('delivery_times', con=engine, if_exists='append', index=False)

1000

In [20]:
fleet_details = pd.read_csv('fleet_details.csv')
fleet_details.head()

  vehicle_id vehicle_type     capacity availability
0         V1         Bike  3817.087159  Unavailable
1         V2          Van  4204.131422  Unavailable
2         V3          Van  5294.939222  Unavailable
3         V4          Van  5853.999226  Unavailable
4         V5          Van  2085.171816  Unavailable

In [21]:
# Create player table
cursor.execute("""
CREATE TABLE IF NOT EXISTS fleet_details (
    vehicle_id VARCHAR(50),
    vehicle_type VARCHAR(100),
    capacity FLOAT,
    availability VARCHAR(150)
    
)
""")
print("fleet_details table created successfully")

fleet_details table created successfully

In [22]:
fleet_details.to_sql('fleet_details', con=engine, if_exists='append', index=False)

50

In [23]:
operational_costs = pd.read_csv('operational_costs.csv')
operational_costs

    cost_id shipment_id  cost_amount   cost_date
0        C1        S189   553.769406  2023-01-01
1        C2        S574   553.305346  2023-01-02
2        C3        S484   923.344024  2023-01-03
3        C4        S631   506.020529  2023-01-04
4        C5        S727   321.983967  2023-01-05
..      ...         ...          ...         ...
495    C496        S429   523.852823  2024-05-10
496    C497        S584   877.362903  2024-05-11
497    C498        S682   708.312848  2024-05-12
498    C499        S132   847.497353  2024-05-13
499    C500        S154   854.267118  2024-05-14

[500 rows x 4 columns]

In [24]:
# Create player table
cursor.execute("""
CREATE TABLE IF NOT EXISTS operational_costs (
    cost_id VARCHAR(50),
    shipment_id VARCHAR(50),
    cost_amount FLOAT,
    cost_date DATE
    
)
""")
print("operational_costs table created successfully")

operational_costs table created successfully

In [25]:
operational_costs.to_sql('operational_costs', con=engine, if_exists='append', index=False)

500

In [27]:
shipments = pd.read_csv('shipments.csv')
shipments

    shipment_id   origin destination      weight shipment_date
0            S1  City_41     City_22  572.464754    2023-01-01
1            S2   City_8     City_84  917.240038    2023-01-02
2            S3   City_9     City_74  405.941360    2023-01-03
3            S4  City_24     City_36  567.503241    2023-01-04
4            S5  City_52     City_59  234.766030    2023-01-05
..          ...      ...         ...         ...           ...
995        S996  City_33      City_4  295.869560    2025-09-22
996        S997  City_56      City_9  760.127311    2025-09-23
997        S998  City_46     City_48  537.581392    2025-09-24
998        S999  City_60     City_45  473.937612    2025-09-25
999       S1000  City_74      City_9  897.961981    2025-09-26

[1000 rows x 5 columns]

In [28]:
# Create player table
cursor.execute("""
CREATE TABLE IF NOT EXISTS shipments (
    shipment_id VARCHAR(50),
    origin VARCHAR(100),
    destination VARCHAR(100),
    weight FLOAT,
    shipment_date DATE
    
)
""")
print("shipments table created successfully")

shipments table created successfully

In [29]:
shipments.to_sql('shipments', con=engine, if_exists='append', index=False)

1000